/*
# https://programmers.co.kr/learn/courses/13007/lessons/87597#
>> 트리 - 계층적인 구조를 나타내는 자료구조
>> 구성 요소
- 노드 : 트리의 데이터를 저장하는 원소, 정점
- Edge : 간선

>> 트리 용어
- 차수 : 자기 자신의 자식 노드 개수 
- 레벨 : 루트노드부터 시작해서 , 얼만큼 멀리 떨어져 있는가 
- 높이 : 루트노드부터 , 가장 멀리 떨어진 리프 노드까지의 거리 (그 사이의 Edge + 1)

>> 이진 트리
- 모든 노드가 최대 2개의 자식을 갖는 트리
- 모든 노드가 2개의 서브트리를 가지고 있는 트리(서브 트리는 빈트리 일 수도 있다.)

>> 포화 이진 트리
- 트리의 모든 레벨에서 노드가 모두 채워져 있는 이진 트리
- 왼쪽 오른쪽 자식 둘다 있음 ( 하나만 있는 경우 X)

>> 완전 이진 트리
- 마지막 레벨을 제외한 모든 레벨에서 노드가 완전히 채워져 있음
- 마지막 레벨에는 노드가 왼쪽부터 채워져 있는 트리

>> 균형 이진 트리
- 모든 노드의 서브 트리간의 높이 차이가 1 이하 



*/